0 4481774
227 233727
110 157431
226 99199
335 95840
109 75303
2 63730
375 58729
298 55516
119 54779
334 54414
373 51236
218 49253
370 48025
124 47978
1 42702
406 38358
39 36757
41 36649
118 35656
341 34329
37 33487
224 32795
181 29874
217 29170
411 26574
232 26086
7 20985
73 20293
116 15880
77 14615
190 12837
337 12279
377 10935
3 9488
194 9045
289 8797
234 8658
371 8476
414 7341
117 6766
378 6306
120 6125
339 5990
220 5681
228 5609
302 5596
342 5320
294 5177
262 5140
81 5035
38 4903
45 4600
364 4264
306 3937
48 3928
9 3871
332 3839
5 3827
16 3769
43 3752
112 3746
145 3505
126 3410
233 3356
374 3100
113 2964
376 2773
123 2751
231 2726
189 2618
225 2610
372 2497
115 2474
186 2402
230 2235
338 2225
303 2148
328 2029
263 1994
111 1902
221 1883
264 1869
229 1844
353 1826
156 1704
185 1640
40 1624
256 1620
42 1615
409 1572
122 1563
340 1556
114 1550
6 1500
266 1490
12 1441
352 1383
154 1344
222 1338
147 1219
267 1063
11 1057
265 1024
148 1021
198 1018
270 995
149 993
10 981
158 963
326 946
150 942
402 942
86 941
245 921
146 892
253 875
75 868
299 864
244 800
192 786
8 771
292 756
297 756
425 753
336 727
258 723
300 723
368 721
325 700
50 689
137 684
268 680
366 674
355 668
153 659
18 634
354 631
410 594
44 587
136 585
52 576
29 575
160 565
424 554
46 548
426 540
196 532
54 527
389 521
333 510
304 508
182 504
4 498
360 465
407 460
246 426
155 406
184 368
369 368
296 367
361 365
427 359
28 356
151 347
388 316
397 305
125 285
260 285
65 279
357 278
101 271
269 264
247 263
400 263
82 257
261 252
223 251
317 249
74 239
138 238
356 236
390 235
30 233
162 232
188 232
209 231
432 230
254 223
152 221
412 221
47 220
191 215
31 213
358 206
139 205
84 205
78 204
391 199
90 196
252 195
219 179
359 176
248 175
121 169
405 166
413 161
100 154
102 147
64 147
195 144
318 141
144 140
183 140
66 138
208 137
211 137
396 126
316 125
362 125
210 122
319 122
301 121
408 120
103 119
428 117
255 114
159 113
249 113
67 113
293 108
80 106
290 104
157 99
257 98
36 96
305 92
431 92
330 86
250 82
251 82
430 74
392 73
15 72
161 71
14 69
142 67
365 67
143 65
216 63
429 63
140 61
51 61
76 59
215 58
324 57
329 57
395 55
108 51
141 51
259 51
35 49
187 47
394 44
173 43
68 43
79 42
197 41
105 39
321 39
33 39
32 37
393 37
72 37
107 36
34 36
322 35
214 31
320 31
88 31
13 30
281 29
323 27
212 26
291 26
404 26
363 25
69 24
104 23
106 23
49 23
70 23
71 21
174 20
327 20
193 19
213 15
282 15
175 11
295 11
53 11
17 9
283 9
288 9
180 8
280 8
331 6
403 6
178 5
284 5
285 5
89 5
